def solution(n):
    arr = [[0] * i for i in range(1, n+1)]
    
    # 시작하기 전에 위치를 미리 세팅해둡니다.
    # 첫 스텝에 아래로(r += 1) 이동해서 (0, 0)이 되도록 r을 -1로 둡니다.
    r, c = -1, 0 
    num = 1
    
    # i는 방향을 나타냅니다. (0: 아래, 1: 오른쪽, 2: 대각선 위)
    for i in range(n):
        # j는 그 방향으로 몇 칸 전진할지를 나타냅니다. (n, n-1, n-2... 칸)
        for j in range(n - i):
            if i % 3 == 0:     # 0, 3, 6... 번째 방향 전환: 아래로
                r += 1
            elif i % 3 == 1:   # 1, 4, 7... 번째 방향 전환: 오른쪽으로
                c += 1
            elif i % 3 == 2:   # 2, 5, 8... 번째 방향 전환: 왼쪽 대각선 위로
                # [여기에 들어갈 r과 c의 변화는?]
                r-=1
                c-=1
            # 이동한 좌표에 숫자를 채워 넣습니다.
            arr[r][c] = num
            num += 1
            
    # arr을 1차원 배열로 쭉 펴서 반환하면 끝!
    return [i  for row in arr for i in row]
